# Projeto de Bases de Dados - Parte 3

### Docente Responsável

Prof. FirstName LastName

### Grupo GG
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
<dl>

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

There's a new jupysql version available (0.7.8), you're running 0.7.4. To upgrade: pip install jupysql --upgrade

# Empresa de comércio online

## 0. Carregamento da Base de Dados

Carregue o esquema de Base de Dados apresentado no Anexo A.

In [2]:
%%sql

DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;

CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255)
);

CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
--order_no must exist in contains
);

CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);

CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL
--age must be >=18
);

CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);

CREATE TABLE department(
name VARCHAR PRIMARY KEY
);

CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
--address must be in warehouse or office but not both
);

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);

CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);

CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);

CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);

CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

Crie as instruções para o seu preenchimento de forma consistente, garantindo que todas as consultas SQL e OLAP, apresentadas mais adiante, produzam um resultado não vazio.

In [3]:
%%sql
-- populate.sql
INSERT INTO customer VALUES (1, 'John Smith', 'johnsmith@mail.com', 234567890, 'Rua das Taipas 6, 4050-599 Porto');
INSERT INTO customer VALUES (2, 'Alice Johnson', 'alicejohnson@mail.com', 987654321, 'Av. da Liberdade 3, 1250-096 Lisboa');
INSERT INTO customer VALUES (3, 'Michael Brown', 'michaelbrown@mail.com', 551234567, 'Largo do Casal Galego 12, 3100-253 Pombal');
INSERT INTO customer VALUES (4, 'Emily Davis', 'emilydavis@mail.com', 219876543, 'R. do Tejo 2, 2250-035 Constância');
INSERT INTO customer VALUES (5, 'Daniel Wilson', 'danielwilson@mail.com', 888555134, 'Praça da Republica 35, 7800-192 Beja');
INSERT INTO customer VALUES (6, 'Sophia Martinez', 'sophiamartinez@mail.com', 246813790, 'Rua da Moeda 8, 7800-464 Beja');
INSERT INTO customer VALUES (7, 'Liam Anderson', 'liamanderson@mail.com', 777999888, 'Praça Luís de Camões 37, 1200-243 Lisboa');
INSERT INTO customer VALUES (8, 'Olivia Taylor', 'oliviataylor@mail.com', 111222333, 'Rua dos Cavaleiros 17, 1100-132 Lisboa');
INSERT INTO customer VALUES (9, 'James Thomas', 'jamesthomas@mail.com',444777111, 'Rua do Almada 51, 4050-036 Porto');
INSERT INTO customer VALUES (10, 'Isabella Clark', 'isabellaclark@mail.com', 999888777, 'R. Laureano de Oliveira 28, 1885-009 Moscavide');

INSERT INTO orders VALUES (1, 2, '2022-12-20');
INSERT INTO orders VALUES (2, 4, '2023-12-22');
INSERT INTO orders VALUES (3, 6, '2023-01-24');
INSERT INTO orders VALUES (4, 8, '2022-12-31');
INSERT INTO orders VALUES (5, 10, '2023-02-27');
INSERT INTO orders VALUES (6, 1, '2023-03-06');
INSERT INTO orders VALUES (7, 3, '2023-04-07');
INSERT INTO orders VALUES (8, 5, '2023-05-08');
INSERT INTO orders VALUES (9, 7, '2023-05-09');
INSERT INTO orders VALUES (10, 9, '2023-05-10');

INSERT INTO pay VALUES (1, 2);
INSERT INTO pay VALUES (2, 4);
INSERT INTO pay VALUES (3, 6);
INSERT INTO pay VALUES (4, 8);
INSERT INTO pay VALUES (5, 10);
INSERT INTO pay VALUES (6, 1);
INSERT INTO pay VALUES (7, 6);
INSERT INTO pay VALUES (8, 5);
INSERT INTO pay VALUES (9, 7);
INSERT INTO pay VALUES (10, 9);

INSERT INTO employee VALUES (111221111, 111111100, DATE '1990-01-01', 'John Snow');
INSERT INTO employee VALUES (222332222, 222222200, DATE '1993-04-22', 'Alice White');
INSERT INTO employee VALUES (333443333, 333333300, DATE '1990-07-03', 'Michael Black');
INSERT INTO employee VALUES (444554444, 444444400, DATE '1994-10-14', 'Emily Green');
INSERT INTO employee VALUES (555665555, 555555500, DATE '1991-01-25', 'Daniel Brown');
INSERT INTO employee VALUES (666776666, 666666600, DATE '1992-04-06', 'Sophia Gray');
INSERT INTO employee VALUES (777887777, 777777700, DATE '1995-07-17', 'Liam Taylor');
INSERT INTO employee VALUES (888998888, 888888800, DATE '1993-10-28', 'Olivia Anderson');
INSERT INTO employee VALUES (999009999, 999999900, DATE '1996-01-08', 'James Martinez');
INSERT INTO employee VALUES (000110000, 101010100, DATE '1994-04-19', 'Isabella Clark');

INSERT INTO process VALUES (111221111, 1);
INSERT INTO process VALUES (222332222, 2);
INSERT INTO process VALUES (333443333, 3);
INSERT INTO process VALUES (444554444, 4);
INSERT INTO process VALUES (777887777, 5);

INSERT INTO department VALUES ('Sales');
INSERT INTO department VALUES ('Marketing');
INSERT INTO department VALUES ('Human Resources');
INSERT INTO department VALUES ('Research and Development');
INSERT INTO department VALUES ('Accounting');

INSERT INTO workplace VALUES ('R. Dr. Gama Barros 15A, 1700-265 Lisboa', 38.747940, -9.139670);
INSERT INTO workplace VALUES ('R. Anchieta 15, 1200-224 Lisboa', 38.710332, -9.141162);
INSERT INTO workplace VALUES ('R. Nova da Trindade 18, 1200-303 Lisboa', 38.712365, -9.142324);
INSERT INTO workplace VALUES ('Passeio de São Lázaro 5, 4000-507 Porto', 41.145921, -8.603300);
INSERT INTO workplace VALUES ('R. da Ponte Nova 5, 4050-485 Porto', 41.143220, -8.613050);
INSERT INTO workplace VALUES ('Estrada Nacional n.º 1 – Vale Courelas, 3100-346 Pombal', 39.891420, -8.661730);
INSERT INTO workplace VALUES ('Av. Libertadores de Timor Loro Sae, 2840-168 Arrentela', 38.611690, -9.107320);
INSERT INTO workplace VALUES ('Av. Algarve 5, 8135-182 Almancil', 37.089950, -8.035850);

INSERT INTO works VALUES (111221111, 'Human Resources', 'R. Dr. Gama Barros 15A, 1700-265 Lisboa');
INSERT INTO works VALUES (222332222, 'Sales', 'Av. Libertadores de Timor Loro Sae, 2840-168 Arrentela');
INSERT INTO works VALUES (333443333, 'Sales', 'Av. Algarve 5, 8135-182 Almancil');
INSERT INTO works VALUES (444554444, 'Marketing', 'R. Anchieta 15, 1200-224 Lisboa');
INSERT INTO works VALUES (555665555, 'Research and Development', 'R. Nova da Trindade 18, 1200-303 Lisboa');
INSERT INTO works VALUES (666776666, 'Accounting', 'R. da Ponte Nova 5, 4050-485 Porto');
INSERT INTO works VALUES (777887777, 'Human Resources', 'R. Anchieta 15, 1200-224 Lisboa');
INSERT INTO works VALUES (888998888, 'Sales', 'Estrada Nacional n.º 1 – Vale Courelas, 3100-346 Pombal');
INSERT INTO works VALUES (999009999, 'Sales', 'Av. Algarve 5, 8135-182 Almancil');
INSERT INTO works VALUES (000110000, 'Marketing', 'Passeio de São Lázaro 5, 4000-507 Porto');

INSERT INTO office VALUES ('R. Dr. Gama Barros 15A, 1700-265 Lisboa');
INSERT INTO office VALUES ('R. Anchieta 15, 1200-224 Lisboa');
INSERT INTO office VALUES ('R. Nova da Trindade 18, 1200-303 Lisboa');
INSERT INTO office VALUES ('Passeio de São Lázaro 5, 4000-507 Porto');

INSERT INTO warehouse VALUES ('Estrada Nacional n.º 1 – Vale Courelas, 3100-346 Pombal');
INSERT INTO warehouse VALUES ('Av. Libertadores de Timor Loro Sae, 2840-168 Arrentela');
INSERT INTO warehouse VALUES ('Av. Algarve 5, 8135-182 Almancil');


INSERT INTO product VALUES ('PLT-PAP-PNK-09', 'Paper Plates (pink)', 'Pink paper plates 9" diameter - 50 pack', 4.99);
INSERT INTO product VALUES ('PLT-PAP-BLU-09', 'Paper Plates (blue)', 'Blue paper plates 9" diameter - 50 pack', 4.99);
INSERT INTO product VALUES ('PLT-PAP-WHT-09', 'Paper Plates (white)', 'White paper plates 9" diameter - 50 pack', 4.99);
INSERT INTO product VALUES ('PLT-PAP-RBP-09', 'Paper Plates (rainbow polka)', 'Rainbow Polka paper plates 9" diameter - 50 pack', 5.49);
INSERT INTO product VALUES ('PLT-PAP-USA-09', 'Paper Plates (American Flag)', 'American Flag paper plates 9" diameter - 50 pack', 5.49);
INSERT INTO product VALUES ('CUP-PAP-PNK-25', 'Paper Cups (pink)', 'Pink paper cups 25cL- 50 pack', 3.49);
INSERT INTO product VALUES ('CUP-PAP-BLU-25', 'Paper Cups (blue)', 'Blue paper cups 25cL- 50 pack', 3.49);
INSERT INTO product VALUES ('CUP-PAP-WHT-25', 'Paper Cups (white)', 'White paper cups 25cL - 50 pack', 3.49, 1234567891236);
INSERT INTO product VALUES ('CUP-PAP-RBP-25', 'Paper Cups (rainbow polka)', 'Rainbow Polka paper cups 25cL - 50 pack', 3.99, 1234567891235);
INSERT INTO product VALUES ('CUP-PAP-USA-25', 'Paper Cups (American Flag)', 'American Flag paper cups 25cL - 50 pack', 3.99, 1234567891234);
INSERT INTO product VALUES ('CUP-PAP-PNK-10', 'Napkins (pink)', 'Pink napkins 10"x10" - 50 pack', 4.49);
INSERT INTO product VALUES ('CUP-PAP-BLU-10', 'Napkins (blue)', 'Blue napkins 10"x10" - 50 pack', 4.49, 1234567891237);
INSERT INTO product VALUES ('CUP-PAP-WHT-10', 'Napkins (white)', 'White napkins 10"x10" - 50 pack', 4.49, 1234567891240);
INSERT INTO product VALUES ('CUP-PAP-RBP-10', 'Napkins (rainbow polka)', 'Rainbow Polka napkins 10"x10" - 50 pack', 4.99, 1234567891239);
INSERT INTO product VALUES ('CUP-PAP-USA-10', 'Napkins (American Flag)', 'American Flag napkins 10"x10" - 50 pack', 4.99, 1234567891238);
INSERT INTO product VALUES ('FOR-PLA-WHT-50', 'Plastic Forks', 'Plastic forks - 50 pack', 2.99);
INSERT INTO product VALUES ('SPN-PLA-WHT-50', 'Plastic Spoons', 'Plastic spoons - 50 pack', 2.99);
INSERT INTO product VALUES ('KNF-PLA-WHT-50', 'Plastic Knives', 'Plastic knives - 50 pack', 2.99);
INSERT INTO product VALUES ('BPC-PLA-CSC-47', 'Beer Pong cups - Classic', 'Classic red and blue plastic Beer Pong cups 47cL - 1 set', 5.00);
INSERT INTO product VALUES ('BPC-PLA-USA-47', 'Beer Pong cups - American', 'American flag plastic Beer Pong cups 47cL - 1 set', 6.00);
INSERT INTO product VALUES ('BPC-PLA-RBW-47', 'Beer Pong cups - Rainbow', 'Rainbow plastic Beer Pong cups 47cL - 1 set', 6.00);
INSERT INTO product VALUES ('PIN-PAP-CSC-50', 'Pinata - classic', 'Classic pinata, 50cmx50cm', 15.00);
INSERT INTO product VALUES ('PIN-PAP-UNI-50', 'Pinata - Unicorn', 'Unicorn pinata, 50cmx50cm', 15.00);
INSERT INTO product VALUES ('PIN-PAP-FLP-50', 'Pinata - Flip Flop', 'Flip flop pinata, 50cmx50cm', 15.00);
INSERT INTO product VALUES ('PIN-PAP-RBW-50', 'Pinata - Rainbow', 'Rainbow shaped pinata, 50cmx50cm', 15.00);
INSERT INTO product VALUES ('PIN-PAP-BUS-75', 'Pinata buster', 'Pinata buster, 75cm', 4.99);
INSERT INTO product VALUES ('PIN-PAP-BLD-00', 'Pinata blindfold', 'Pinata blindfold', 2.99);
INSERT INTO product VALUES ('HAT-PAP-PNK-10', 'Party hats (pink)', 'Pink party hats - 10 pack', 3.99);
INSERT INTO product VALUES ('HAT-PAP-BLU-10', 'Party hats (blue)', 'Blue party hats - 10 pack', 3.99);
INSERT INTO product VALUES ('HAT-PAP-WHT-10', 'Party hats (white)', 'White party hats - 10 pack', 3.99);
INSERT INTO product VALUES ('HAT-PAP-RBP-10', 'Party hats (rainbow polka)', 'Rainbow Polka party hats - 10 pack', 4.49);
INSERT INTO product VALUES ('HAT-PAP-USA-10', 'Party hats (American Flag)', 'American Flag party hats - 10 pack', 4.49);
INSERT INTO product VALUES ('HEL-CAN-SML-30', 'Helium Canister', 'Helium canister that fills up to 30 9" balloons', 29.99);
INSERT INTO product VALUES ('HEL-CAN-LAR-50', 'Helium Canister - Large', 'Large Helium canister that fills up to 50 9" balloons', 39.99);
INSERT INTO product VALUES ('HEL-CAN-XXL-90', 'Helium Canister - XXL', 'XXL Helium canister that fills up to 90 9" balloons', 59.99);
INSERT INTO product VALUES ('FOG-MCH-NLD-2K', 'Fog Machine', 'Fog machine with wireless controller, 500W and 2000CFM output', 51.99);
INSERT INTO product VALUES ('FOG-MCH-LED-2K', 'Fog Machine - LEDs', 'Fog machine with wireless controller, 500W and 2000CFM output, with 13 colorful LED lights', 61.99);
INSERT INTO product VALUES ('BUB-MCH-SML-38', 'Bubble Machine - Small', 'Small automatic bubble blower - 38cL', 29.99);
INSERT INTO product VALUES ('BUB-MCH-LRG-75', 'Bubble Machine - Large', 'Large automatic bubble blower - 75cL', 55.29);
INSERT INTO product VALUES ('BUB-MCH-GUN-35', 'Bubble Machine - Gun', 'Automatic bubble blower Gun - 35cL', 31.99);

INSERT INTO contains VALUES (1, 'PLT-PAP-USA-09', 2);
INSERT INTO contains VALUES (2, 'HEL-CAN-XXL-90', 1);
INSERT INTO contains VALUES (3, 'BPC-PLA-CSC-47', 4);
INSERT INTO contains VALUES (4, 'BUB-MCH-LRG-75', 2);
INSERT INTO contains VALUES (5, 'PIN-PAP-FLP-50', 1);
INSERT INTO contains VALUES (6, 'CUP-PAP-WHT-25', 2);
INSERT INTO contains VALUES (7, 'CUP-PAP-RBP-25', 2);
INSERT INTO contains VALUES (8, 'CUP-PAP-USA-25', 10);
INSERT INTO contains VALUES (9, 'HAT-PAP-WHT-10', 1);
INSERT INTO contains VALUES (10, 'CUP-PAP-BLU-10', 2);


INSERT INTO supplier VALUES (0000000001, 'Papier Makier', 'Largo de Andaluz 15A, 1050-004 Lisboa', 'CUP-PAP-USA-25', '2022-11-25');
INSERT INTO supplier VALUES (0000000002, 'Bubble POP!', 'Av. Miguel Bombarda 67A, 1050-162 Lisboa', 'BUB-MCH-LRG-75', '2022-10-22');
INSERT INTO supplier VALUES (0000000003, 'HE HE!', 'R. Abranches Ferrão 4D, 1600-001 Lisboa', 'HEL-CAN-XXL-90', '2023-02-25');
INSERT INTO supplier VALUES (0000000004, 'Pinata Central', 'Av. Antero de Quental 2 Loja 50, 2910-394 Setúbal', 'PIN-PAP-FLP-50', '2023-03-10');
INSERT INTO supplier VALUES (0000000005, 'PONG IT', 'R. Ciprestes 156, 2870-450 Montijo', 'BPC-PLA-CSC-47', '2023-04-13');


INSERT INTO delivery VALUES ('Av. Algarve 5, 8135-182 Almancil', 0000000001);
INSERT INTO delivery VALUES ('Estrada Nacional n.º 1 – Vale Courelas, 3100-346 Pombal', 0000000002);
INSERT INTO delivery VALUES ('Av. Libertadores de Timor Loro Sae, 2840-168 Arrentela', 0000000003);
INSERT INTO delivery VALUES ('Av. Algarve 5, 8135-182 Almancil', 0000000004);
INSERT INTO delivery VALUES ('Av. Algarve 5, 8135-182 Almancil', 0000000005);

*  postgresql://db:***@postgres/db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 1. Restrições de Integridade

Apresente o código para implementar as seguintes restrições de integridade, se necessário, com recurso a extensões procedimentais SQL (Stored Procedures e Triggers):

(RI-1) Nenhum empregado pode ter menos de 18 anos de idade

In [5]:
%%sql
-- (RI-1)

CREATE OR REPLACE FUNCTION invalid_employee_func() RETURNS TRIGGER AS
$$
BEGIN
    IF GETDATE() - YEAR(NEW.bdate) < 18 THEN
        RAISE EXCEPTION 'Employee is under the age of 18';
    END IF;
    RETURN new;
END
$$ LANGUAGE plpgsql;

CREATE TRIGGER invalid_employee AFTER INSERT ON employee
FOR EACH STATEMENT EXECUTE FUNCTION invalid_employee_func();

*  postgresql://db:***@postgres/db
Done.
Done.

[]

(RI-2) Um 'Workplace' é obrigatoriamente um 'Office' ou 'Warehouse' mas não pode ser ambos

In [6]:
%%sql
-- (RI-2)
-- ?? slide T09 nº 32

CREATE OR REPLACE FUNCTION invalid_workplace_func() RETURNS TRIGGER AS
$$
BEGIN
    IF EXISTS (
        SELECT 1
        FROM workplace
        WHERE address = new.address
    ) THEN
        RAISE EXCEPTION 'Workplace address alredy used.';
    END IF;
END
$$ LANGUAGE plpgsql;

CREATE TRIGGER invalid_workplace_func AFTER INSERT ON office
FOR EACH STATEMENT EXECUTE FUNCTION invalid_workplace_func();

CREATE TRIGGER invalid_workplace_func AFTER INSERT ON warehouse
FOR EACH STATEMENT EXECUTE FUNCTION invalid_workplace_func();

*  postgresql://db:***@postgres/db
Done.
Done.
Done.

[]

(RI-3) Uma 'Order' tem de figurar obrigatoriamente em 'Contains'.

In [7]:
%%sql
-- (RI-3)
CREATE OR REPLACE FUNCTION order_in_contains_func() RETURNS TRIGGER AS
$$
BEGIN
    IF EXISTS (
        SELECT 1
        FROM contains
        WHERE order_no = new.order_no
    ) THEN
        RAISE EXCEPTION 'Order_no id not in contains.';
    END IF;
    RETURN new;
END
$$ LANGUAGE plpgsql;

CREATE TRIGGER order_in_contains_func AFTER INSERT ON orders
FOR EACH STATEMENT EXECUTE FUNCTION order_in_contains_func();

*  postgresql://db:***@postgres/db
Done.
Done.

[]

## 2. Consultas SQL

Apresente a consulta SQL mais sucinta para cada uma das seguintes questões

1) Qual o número e nome do(s) cliente(s) com maior valor total de encomendas pagas?

In [8]:
%%sql

SELECT cust_no, customer.name 
FROM customer 
    JOIN pay USING (cust_no)
    JOIN contains USING (order_no)
    JOIN product USING (SKU)
GROUP BY cust_no
HAVING SUM(qty * price) >= ALL (
    SELECT SUM(qty*price)
    FROM customer 
        JOIN pay USING (cust_no)
        JOIN contains USING (order_no)
        JOIN product USING (SKU)
    GROUP BY cust_no);

*  postgresql://db:***@postgres/db
1 rows affected.

[(8, 'Olivia Taylor')]

2. Qual o nome dos empregados que processaram encomendas em todos os dias de 2022 em que houve encomendas?

In [9]:
%%sql

SELECT e.ssn, e.name
FROM employee e
WHERE NOT EXISTS (
  SELECT o.date
  FROM orders o
  WHERE o.date >= '2022-01-01' AND o.date <= '2022-12-31'
    AND NOT EXISTS (
      SELECT *
      FROM process p
      WHERE p.ssn = e.ssn AND p.order_no = o.order_no
    )
);

*  postgresql://db:***@postgres/db
0 rows affected.

[]

3. Quantas encomendas foram realizadas mas não pagas em cada mês de 2022?

In [10]:
%%sql

SELECT COUNT(*) AS orders_not_payed
FROM orders
WHERE order_no NOT IN 
    (SELECT order_no FROM pay);

*  postgresql://db:***@postgres/db
1 rows affected.

[(0,)]

## 3. Vistas

Crie uma vista que resuma as informações mais importantes sobre as vendas de produtos, combinando informações de diferentes tabelas do esquema de base de dados. A vista deve ter o seguinte esquema:

product_sales(sku, order_no, qty, total_price, year, month, day_of_month, day_of_week, city)

In [11]:
%%sql

CREATE VIEW product_sales AS
SELECT
    c.sku,
    o.order_no,
    c.qty,
    p.price * c.qty AS total_price,
    EXTRACT(YEAR FROM o.date) AS year,
    EXTRACT(MONTH FROM o.date) AS month,
    EXTRACT(DAY FROM o.date) AS day_of_month,
    EXTRACT(DOW FROM o.date) AS day_of_week,
    SUBSTRING(cust.address, 1, POSITION(',' IN cust.address) - 1) AS city
FROM
    contains c
    JOIN orders o ON c.order_no = o.order_no
    JOIN product p ON c.sku = p.sku
    JOIN customer cust ON o.cust_no = cust.cust_no;

*  postgresql://db:***@postgres/db
Done.

[]

## 4. Desenvolvimento de Aplicação

### Explicação da arquitetura da aplicação web, incluindo um link para uma versão de trabalho e as relações entre os vários ficheiros na pasta web/arquivos

...

## 5. Consultas OLAP

Usando a vista desenvolvida para a Questão 3, escreva duas consultas SQL que permitam analisar:

1. As quantidade e valores totais de venda de cada produto em 2022, globalmente, por cidade, por mês, dia do mês e dia da semana

In [12]:
%%sql


SELECT
    sku,
    SUM(qty) as qty,
    SUM(total_price) as total_sales,
    'Globally' AS location,
    month,
    day_of_month,
    day_of_week
FROM product_sales
GROUP BY sku, month, day_of_month, day_of_week

UNION 

SELECT
    sku,
    SUM(qty) as qty,
    SUM(total_price) as total_sales,
    city AS location,
    month,
    day_of_month,
    day_of_week
FROM product_sales
GROUP BY sku, month, day_of_month, day_of_week, product_sales.city

ORDER BY sku

*  postgresql://db:***@postgres/db
20 rows affected.

[('BPC-PLA-CSC-47', 4, Decimal('20.00'), 'Globally', Decimal('1'), Decimal('24'), Decimal('2')),
 ('BPC-PLA-CSC-47', 4, Decimal('20.00'), 'Rua da Moeda 8', Decimal('1'), Decimal('24'), Decimal('2')),
 ('BUB-MCH-LRG-75', 2, Decimal('110.58'), 'Globally', Decimal('12'), Decimal('31'), Decimal('6')),
 ('BUB-MCH-LRG-75', 2, Decimal('110.58'), 'Rua dos Cavaleiros 17', Decimal('12'), Decimal('31'), Decimal('6')),
 ('CUP-PAP-BLU-10', 2, Decimal('8.98'), 'Globally', Decimal('5'), Decimal('10'), Decimal('3')),
 ('CUP-PAP-BLU-10', 2, Decimal('8.98'), 'Rua do Almada 51', Decimal('5'), Decimal('10'), Decimal('3')),
 ('CUP-PAP-RBP-25', 2, Decimal('7.98'), 'Globally', Decimal('4'), Decimal('7'), Decimal('5')),
 ('CUP-PAP-RBP-25', 2, Decimal('7.98'), 'Largo do Casal Galego 12', Decimal('4'), Decimal('7'), Decimal('5')),
 ('CUP-PAP-USA-25', 10, Decimal('39.90'), 'Praça da Republica 35', Decimal('5'), Decimal('8'), Decimal('1')),
 ('CUP-PAP-USA-25', 10, Decimal('39.90'), 'Globally', Decimal('5'), Decimal('8'), Decimal('1')),
 ('CUP-PAP-WHT-25', 2, Decimal('6.98'), 'Rua das Taipas 6', Decimal('3'), Decimal('6'), Decimal('1')),
 ('CUP-PAP-WHT-25', 2, Decimal('6.98'), 'Globally', Decimal('3'), Decimal('6'), Decimal('1')),
 ('HAT-PAP-WHT-10', 1, Decimal('3.99'), 'Globally', Decimal('5'), Decimal('9'), Decimal('2')),
 ('HAT-PAP-WHT-10', 1, Decimal('3.99'), 'Praça Luís de Camões 37', Decimal('5'), Decimal('9'), Decimal('2')),
 ('HEL-CAN-XXL-90', 1, Decimal('59.99'), 'R. do Tejo 2', Decimal('12'), Decimal('22'), Decimal('5')),
 ('HEL-CAN-XXL-90', 1, Decimal('59.99'), 'Globally', Decimal('12'), Decimal('22'), Decimal('5')),
 ('PIN-PAP-FLP-50', 1, Decimal('15.00'), 'Globally', Decimal('2'), Decimal('27'), Decimal('1')),
 ('PIN-PAP-FLP-50', 1, Decimal('15.00'), 'R. Laureano de Oliveira 28', Decimal('2'), Decimal('27'), Decimal('1')),
 ('PLT-PAP-USA-09', 2, Decimal('10.98'), 'Av. da Liberdade 3', Decimal('12'), Decimal('20'), Decimal('2')),
 ('PLT-PAP-USA-09', 2, Decimal('10.98'), 'Globally', Decimal('12'), Decimal('20'), Decimal('2'))]

2. O valor médio diário das vendas de todos os produtos em 2022, globalmente, por mês e dia da semana

In [13]:
%%sql

SELECT
    'Globally' AS location,
    month,
    day_of_week,
    ROUND(AVG(total_price), 2) AS average_daily_value
FROM
    product_sales
WHERE
    year = 2022
GROUP BY
    month, day_of_week

*  postgresql://db:***@postgres/db
2 rows affected.

[('Globally', Decimal('12'), Decimal('2'), Decimal('10.98')),
 ('Globally', Decimal('12'), Decimal('6'), Decimal('110.58'))]

## 6. Índices

Indique, com a devida justificação, que tipo de índice(s), sobre qual(is) atributo(s) e sobre qual(is) tabela(s) faria sentido criar, de forma a agilizar a execução de cada uma das seguintes consultas:

### 6.1
SELECT order_no
FROM orders 
JOIN contains USING (order_no) 
JOIN product USING (SKU) 
WHERE price > 50 AND 
EXTRACT(YEAR FROM date) = 2023

### Tipo de Índice, Atributos & Justificação

indice para o order_no nas tabelas orders e contains para otimizar a execução do join sobre essas tabelas. dado que estas tabelas são frequentemente atualizadas o indice seria do tipo não clusterizado, pois este tem menor impacto em operações insert/update/delete

adicionalmente poderia-se criar um indice não clusterizado para o price na tabela product para agilizar a filtragem  price > 50

### 6.2
SELECT order_no, SUM(qty*price)
FROM contains 
JOIN product USING (SKU) 
WHERE name LIKE ‘A%’ 
GROUP BY order_no;

### Tipo de Índice, Atributos & Justificação

indice nao clusterizado para o order_no na tabela contains para agilizar o join e o group

indice nao clusterizado para o sku na tabela product para agilizar o join

indice nao clusterizado para o name na tabela product para facilitar a filtragem